Documents/ВводНачальныхОстатковВыданныхСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковВыданныхСИЗ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыдачиСИЗПоНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.ВыданныеСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Сумма в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПодразделения</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВыданныеСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыданныеСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыдачиСИЗПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыдачиСИЗПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокНоскиПродлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВыдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводНачальныхОстатковВыданныхСИЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Для Индекс = 0 По РабочиеМеста.Количество()-1 Цикл
		СтрокаРабочееМесто = РабочиеМеста.Получить(Индекс);
		СтрокиНоменклатурыРабочегоМеста = НоменклатураСИЗ.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
		
		Для Каждого СтрокаНоменклатураСИЗ Из СтрокиНоменклатурыРабочегоМеста Цикл
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"Номенклатура", НСтр("ru = 'номенклатура'"));
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"ДатаВыдачи", НСтр("ru = 'дата выдачи'"));
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"ДатаСледующейВыдачи", НСтр("ru = 'дата следующей выдачи'"));
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		ЗаписьНабора = Движения.ВыданныеСИЗ.Добавить();
		ЗаписьНабора.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьНабора.Период = СтрокаТаблицы.ДатаВыдачи;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ЗаписьНабора.ОснованиеВыдачи = Ссылка;
		ЗаписьНабора.Количество = СтрокаТаблицы.Количество;
		ЗаписьНабора.Дежурное = СтрокаТаблицы.Дежурное;
		Движения.ВыданныеСИЗ.Записывать = Истина;
		
		ЗаписьНабора = Движения.ВыдачиСИЗПоНоменклатуре.Добавить();
		ЗаписьНабора.Период = СтрокаТаблицы.ДатаВыдачи;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.Выдано;
		ЗаписьНабора.ОснованиеВыдачи = Ссылка;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ЗаписьНабора.ДатаСледующейВыдачи = СтрокаТаблицы.ДатаСледующейВыдачи;
		Движения.ВыдачиСИЗПоНоменклатуре.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗТребующиеВыдачи(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста = "РабочееМесто", Сч = 1, ДобавлятьБезСИЗ = Ложь) Экспорт
	
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, , Истина);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), КонецДня(ТекущаяДатаСеанса()));
	
	ФизическиеЛицаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("ФизическоеЛицо");
	АнтропометрияФизическихЛиц = СредстваИндивидуальнойЗащиты.АнтропометрияФизическихЛиц(ФизическиеЛицаСотрудников);
	
	СИЗТребующиеВыдачи = СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности);
	ТипыНоменклатурыСИЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СИЗТребующиеВыдачи.ВыгрузитьКолонку("СИЗ"), "ТипНоменклатуры");
	РабочиеМестаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	РеквизитыРабочихМест = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РабочиеМестаСотрудников, "Подразделение,Должность");
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗРабочихМест = СИЗТребующиеВыдачи.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		КоличествоСИЗ = СИЗРабочихМест.Количество();
		Если КоличествоСИЗ = 0 И Не ДобавлятьБезСИЗ Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		Сч = Сч + 1;
		НоваяСтрока.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ДанныеСИЗ.РабочееМесто;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыРабочихМест.Получить(НоваяСтрока.РабочееМесто));
		Если КоличествоСИЗ = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого НайденныйСИЗ Из СИЗРабочихМест Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			НоваяСтрокаСИЗ.ДатаВыдачи = ДанныеСИЗ.ДатаВыдачи;
			АнтропометрияСотрудника = АнтропометрияФизическихЛиц.Получить(НоваяСтрока.ФизическоеЛицо);
			Если АнтропометрияСотрудника <> Неопределено Тогда
				НоваяСтрокаСИЗ.Размер = СредстваИндивидуальнойЗащиты.РазмерСотрудника(
					ТипыНоменклатурыСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ), АнтропометрияСотрудника);
			КонецЕсли;
			
			ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
			ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, НоваяСтрокаСИЗ);
			ОписаниеПериодичности.Кратность = НоваяСтрокаСИЗ.КратностьВыдачи;
			ОписаниеПериодичности.Периодичность = НоваяСтрокаСИЗ.ПериодичностьВыдачи;
			ОписаниеПериодичности.ЕдиницаПериодичности = НоваяСтрокаСИЗ.ЕдиницаПериодичностиВыдачи;
			НоваяСтрокаСИЗ.ДатаСледующейВыдачи = СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(Дата, ОписаниеПериодичности);
			
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = НоваяСтрока.ИдентификаторСтрокиРабочегоМеста;
		КонецЦикла;
	КонецЦикла;
	
	СредстваИндивидуальнойЗащиты.ПодобратьПодходящуюНоменклатуру(НоменклатураСИЗ, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымИзФайла(АдресЗагруженныхДанных) Экспорт
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ЗагруженныеДанные, "ФизическоеЛицо");
	
	РабочиеМеста.Очистить();
	НоменклатураСИЗ.Очистить();
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ЗагруженныеДанные.ВыгрузитьКолонку("ФизическоеЛицо");
	ПараметрыПолучения.КадровыеДанные = "РабочееМестоОхраныТруда, Подразделение, Должность";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,
		"РабочееМестоОхраныТруда", "<>", Неопределено);
	
	ПараметрыПолучения.Организация = Организация;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыПолучения.Подразделение = Подразделение;
	КонецЕсли;
	ПараметрыПолучения.НачалоПериода = Дата;
	ПараметрыПолучения.ОкончаниеПериода = Дата;
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Сч = 1 По СотрудникиОрганизации.Количество() Цикл
		Строка = СотрудникиОрганизации[Сч - 1];
		НайденныеСтроки = ЗагруженныеДанные.НайтиСтроки(Новый Структура("ФизическоеЛицо", Строка.ФизическоеЛицо));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.РабочееМесто = Строка.РабочееМестоОхраныТруда;
		НоваяСтрока.Должность = Строка.Должность;
		НоваяСтрока.Подразделение = Строка.Подразделение;
		НоваяСтрока.ФизическоеЛицо = Строка.ФизическоеЛицо;
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденнаяСтрока);
			Если ЗначениеЗаполнено(НоваяСтрокаСИЗ.ЕдиницаПериодичностиВыдачи) Тогда
				НоваяСтрокаСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью;
			Иначе
				НоваяСтрокаСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса;
			КонецЕсли;
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = НоваяСтрока.ИдентификаторСтрокиРабочегоМеста;
			ЗагруженныеДанные.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Если ЗагруженныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЗагруженныеДанные Цикл
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Строку со следующими данными не удалось добавить: Сотрудник ""%1"", СИЗ ""%2"", Номенклатура ""%3""'"),
			Строка.ФизическоеЛицо, Строка.СИЗ, Строка.Номенклатура);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "Объект");
	КонецЦикла;
	
КонецПроцедуры

Функция СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ТаблицаФизическиеЛицаРабочиеМеста, "ВТФизическиеЛицаРабочиеМеста");
	
	СредстваИндивидуальнойЗащиты.СоздатьВТСИЗРабочегоМеста(
		МенеджерВременныхТаблиц, ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаРабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	ФизическиеЛицаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СИЗРабочегоМеста.СИЗ КАК СИЗ,
		|	СИЗРабочегоМеста.СпособВыдачи КАК СпособВыдачи,
		|	СИЗРабочегоМеста.Дежурное КАК Дежурное,
		|	СИЗРабочегоМеста.КратностьВыдачи КАК КратностьВыдачи,
		|	СИЗРабочегоМеста.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СИЗРабочегоМеста.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СИЗРабочегоМеста.Количество КАК Количество,
		|	СИЗРабочегоМеста.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТФизическиеЛицаРабочиеМеста КАК ФизическиеЛицаРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСИЗРабочегоМеста КАК СИЗРабочегоМеста
		|		ПО ФизическиеЛицаРабочиеМеста.РабочееМесто = СИЗРабочегоМеста.РабочееМесто
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РабочееМесто,
		|	СИЗ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ, ИмяПоля, Заголовок)
	
	Если ЗначениеЗаполнено(СтрокаНоменклатураСИЗ[ИмяПоля]) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сотруднику ""%1"" не установлена %2 для выдачи по СИЗ ""%3""'"),
		СтрокаРабочееМесто.ФизическоеЛицо, Заголовок, СтрокаНоменклатураСИЗ.СИЗ);
	Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РабочиеМеста", СтрокаРабочееМесто.НомерСтроки, "ФизическоеЛицо");
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, Поле, "Объект", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
